Autodesk.Revit.DB.ViewSheetSet.IsAutomatic
Automatic order or manual order.

Autodesk.Revit.DB.ViewSheetSet.ViewOrganizationId
Autodesk.Revit.DB.ElementId to the Autodesk.Revit.DB.BrowserOrganization for non-sheet views.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the Autodesk.Revit.DB.ElementId does not reference to Autodesk.Revit.DB.BrowserOrganization, or the target type of Autodesk.Revit.DB.BrowserOrganization is incompatible.
Remarks:
Ignored when Autodesk::Revit::DB::PrintSetup::IsAutomatic is false.

Autodesk.Revit.DB.ViewSheetSet.SheetOrganizationId
Autodesk.Revit.DB.ElementId to the Autodesk.Revit.DB.BrowserOrganization for sheets.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the Autodesk.Revit.DB.ElementId does not reference to Autodesk.Revit.DB.BrowserOrganization, or the target type of Autodesk.Revit.DB.BrowserOrganization is incompatible.
Remarks:
Ignored when Autodesk::Revit::DB::PrintSetup::IsAutomatic is false.

Autodesk.Revit.DB.ViewSheetSet.OrderedViewList
Ordered views.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input ordered view list is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the set operation failed due to invalid view which cannot be printed.

Autodesk.Revit.DB.ViewSheetSet
Represents ViewSheetSets stored in a document.
ViewSheetSets can be stored so that the same printing task can be executed multiple times.
Remarks:
For the in-session ViewSheetSet, see the class Autodesk.Revit.DB.InSessionViewSheetSet.
Changes of ViewSheetSet would be effiective after Autodesk::Revit::DB::ViewSheetSetting::Save